app/controllers/rents_controller.rb

SELECT "rents".* FROM "rents"
---
  def index
    @rents = Rent.all

INSERT INTO "rents" ("address", "price", "room", "bath", "property", "available", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    rent = Rent.create rent_params

SELECT  "rents".* FROM "rents" WHERE "rents"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
---
  def edit
    @rent = Rent.find params[:id]

SELECT  "rents".* FROM "rents" WHERE "rents"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "rents" SET "price" = $1, "property" = $2, "available" = $3, "image" = $4, "updated_at" = $5 WHERE "rents"."id" = $6  [["price", 800], ["property", ""], ["available", "2022-04-22"], ["image", ""], ["updated_at", "2022-04-11 07:05:53.291775"], ["id", 7]]
---
  def update
    rent = Rent.find params[:id]
    rent.update rent_params

SELECT  "rents".* FROM "rents" WHERE "rents"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @rent = Rent.find params[:id]

SELECT  "rents".* FROM "rents" WHERE "rents"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
DELETE FROM "rents" WHERE "rents"."id" = $1  [["id", 58]]
---
  def destroy
    rent = Rent.find params[:id]
    rent.destroy