app/controllers/sells_controller.rb

  def index
    @sells = Sell.all
---
SELECT "sells".* FROM "sells"

  def edit
    @sell = Sell.find params[:id]
---
SELECT  "sells".* FROM "sells" WHERE "sells"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def update
    sell = Sell.find params[:id]
    sell.update sell_params
---
SELECT  "sells".* FROM "sells" WHERE "sells"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "sells" SET "room" = $1, "property" = $2, "available" = $3, "image" = $4, "updated_at" = $5 WHERE "sells"."id" = $6  [["room", 1], ["property", ""], ["available", "2022-04-14"], ["image", ""], ["updated_at", "2022-04-11 07:43:27.154565"], ["id", 11]]

  def show
    @sell = Sell.find params[:id]
---
SELECT  "sells".* FROM "sells" WHERE "sells"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def destroy
    sell = Sell.find params[:id]
    sell.destroy
---
SELECT  "sells".* FROM "sells" WHERE "sells"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "sells" WHERE "sells"."id" = $1  [["id", 10]]